Revit 2026 API

# ProjectLocationDuplicate Method

---

Generate a copy of this project location with the specified name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ProjectLocation Duplicate(
	string name
)
```
```vb
Public Function Duplicate (
	name As String
) As ProjectLocation
```
```cpp
public:
ProjectLocation^ Duplicate(
	String^ name
)
```
```fsharp
member Duplicate :
        name : string -> ProjectLocation
```

#### Parameters

name String

#### Return Value

ProjectLocation A new ProjectLocation which is a duplicate of this location, with the input name.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The name must not be the same as the name of any existing locations. This function will modify the document, as the new ProjectLocation will be added to it.

#### Reference

ProjectLocation Class

Autodesk.Revit.DB Namespace